import { Incident, Sources } from './types';

export const initialIncidents: Incident[] = [
  {
    id: "1773007034931",
    region: "طرابلس",
    station: "الهضبة المشروع",
    equipment: "الهضبة 220",
    eqNumber: "1",
    voltage: "30",
    disconnectTime: "13:58",
    connectTime: "14:57",
    reason: "الوقاية المسافية",
    notes: "",
    status: "مُرجع",
    date: "2026-03-08",
    employeeName: "سالم فرحات"
  }
];

export const sources: Sources = {
  regions: [
    "طرابلس",
    "الغربية",
    "الساحل الغربي",
    "الجبل الغربي",
    "الوسطى",
    "بنغازي"
  ],
  stations: [
    "الهضبة المشروع",
    "بن غشير",
    "المطار",
    "المنارة",
    "مسلاته حديدة",
    "الزجاج",
    "العلالقة",
    "جنوب الجمعة",
    "طريق المطار"
  ],
  equipments: [
    "الهضبة 220",
    "المحول",
    "المجزئي",
    "الربط",
    "الهيرة",
    "النهضة",
    "البرج 220",
    "المحطة بالكامل"
  ],
  voltages: [
    "30",
    "30/11",
    "11",
    "66",
    "220"
  ],
  reasons: [
    "الوقاية المسافية",
    "فقد في التغدية",
    "بعد تامين التغدية",
    "ترجيع وضعية",
    "صيانة وصلة هوائية",
    "تم فصله يدوي",
    "صيانة راس كابل",
    "تامين موقع عمل"
  ],
  employees: [
    "علي صبحي الفطيسي",
    "سالم فرحات",
    "هيثم الغناي"
  ]
};
